load-test.yml
config:
  target: "http://localhost:1337"
  phases:
    - duration: 20   # 20초 동안 천천히 부하를 올림 (급격한 스파이크 방지)
      arrivalRate: 20
      rampTo: 200    # 목표: 초당 200명 진입 (기존 100명 -> 200명 상향)
      name: "Ramp up to 200 users/sec"
    - duration: 60   # 60초 동안 부하 유지
      arrivalRate: 200
      name: "Sustain 200 users/sec"
  engines:
    socketio: {}

scenarios:
  - name: "채팅방 입장 및 지속적 대화"
    engine: "socketio"
    flow:
      # 1. 소켓 연결 및 방 입장
      - emit:
          channel: "chat:get_history"
          data: { "roomId": "1", "limit": 50 }
      
      - think: 2 # 입장 후 채팅방 내역을 읽는 시간 (2초)

      # 2. 메시지 반복 전송 (세션 유지 시간 연장 및 DB 쓰기 부하 증가)
      - loop:
        - emit:
            channel: "chat:message"
            data: 
              ROOM_ID: "1"
              SENDER_ID: "TEST_USER" # 필요 시 {{ $randomString() }} 등으로 동적 할당 가능
              NICKNAME: "LoadTester"
              CONTENT: "부하 테스트 메시지입니다. (반복)"
              TEMP_ID: "test_temp_id"
        - think: 3 # 메시지 사이 입력 대기 시간 (3초)
        count: 5 # 1인당 총 5회 메시지 전송 (총 세션 시간 약 17초+a 로 증가)